# DataFrame  

### 1. value

### 2. single row

### 3. single column

### 4. multi rows
1. continuous
2. non-continuos

### 5. multi columns
1. continuous
2. non-continuos

### 6. range

In [2]:
import numpy as np
import pandas as pd

##### 임의의 DataFrame 생성

In [3]:
df = pd.DataFrame(np.random.randint(0,100,size=(10, 10)), 
                  columns=['col0','col1','col2','col3','col4','col5','col6','col7','col8','col9'], 
                  index=['idx0','idx1','idx2','idx3','idx4','idx5','idx6','idx7','idx8','idx9'])

In [4]:
print(df.shape)
df

(10, 10)

      col0  col1  col2  col3  col4  col5  col6  col7  col8  col9
idx0    56    56    30    77    26     9    40    84    34    78
idx1    39    59    62    26    27    60    30    15    45    36
idx2    63    74    94    43    87     2    19    29    21    18
idx3    20    26    64    13    83    44    62    25    56    48
idx4    95    28    32    92    17    27     3    65    95    72
idx5    62    40    37    24    76    97    74    83    10    97
idx6    94     8    56    68    35    13    72    76    95    15
idx7     9    63    68    15    61    11    39    94    52     9
idx8    37    58    21    34    80    19     4     7    28    53
idx9    26    25    11    34    10    30    87    83    32    44

### Value
![picTitle](./DataFrame_pic/value.jpg)

In [8]:
# []이용
value = df['col3']['idx4']
print(type(value))
value

<class 'numpy.int32'>

92

In [9]:
# at 이용
value = df.at['idx4', 'col3']
print(type(value))
value

<class 'numpy.int32'>

92

In [10]:
# loc 이용
value = df.loc['idx4', 'col3']
print(type(value))
value

<class 'numpy.int32'>

92

In [11]:
# iloc 이용
value = df.iloc[4, 3]
print(type(value))
value

<class 'numpy.int32'>

92

### 단일 Value 선택하는 경우
- []를 이용하는 경우   
    df['column 이름']['index 이름']

- at, loc 를 이용하는 경우   
    df.at['index 이름', 'column 이름']
    df.loc['index이름', 'column 이름']

- iloc 이용하는 경우   
    df.iloc[index 순서, column 순서]

### Single Row
![picTitle](./DataFrame_pic/single_row.jpg)

In [16]:
# []이용
row = df['idx3':'idx3']
print(type(row))
row

<class 'pandas.core.frame.DataFrame'>

      col0  col1  col2  col3  col4  col5  col6  col7  col8  col9
idx3    20    26    64    13    83    44    62    25    56    48

In [17]:
# loc이용(DataSeries 형태, 대괄호 유무)
row = df.loc['idx3']
print(type(row))
row

<class 'pandas.core.series.Series'>

col0    20
col1    26
col2    64
col3    13
col4    83
col5    44
col6    62
col7    25
col8    56
col9    48
Name: idx3, dtype: int32

In [19]:
# loc이용(DataFrame 형태, 대괄호 유무)
row = df.loc[['idx3']]
print(type(row))
row

<class 'pandas.core.frame.DataFrame'>

      col0  col1  col2  col3  col4  col5  col6  col7  col8  col9
idx3    20    26    64    13    83    44    62    25    56    48

In [20]:
# iloc이용(DataSeries 형태, 대괄호 유무)
row = df.iloc[3]
print(type(row))
row

<class 'pandas.core.series.Series'>

col0    20
col1    26
col2    64
col3    13
col4    83
col5    44
col6    62
col7    25
col8    56
col9    48
Name: idx3, dtype: int32

In [21]:
# iloc이용(DataFrame 형태, 대괄호 유무)
row = df.iloc[[3]]
print(type(row))
row

<class 'pandas.core.frame.DataFrame'>

      col0  col1  col2  col3  col4  col5  col6  col7  col8  col9
idx3    20    26    64    13    83    44    62    25    56    48

### 단일 행 선택하는 경우
- []를 이용하는 경우   
    df['index 이름':'index 이름']   
    ※주의 df[]의 경우, 열이 선택된다. 열 이름을 넣으면 1개의 열이 선택된다.

- loc 를 이용하는 경우   
    1. Series 형태   
        df.loc['index이름']   
    2. DataFrame 형태   
        df.loc[['index이름']]   

- iloc 이용하는 경우   
    1. Series 형태   
        df.iloc[index 번호]   
    2. DataFrame 형태   
        df.iloc[[index 번호]]

### Single Column

![picTitle](./DataFrame_pic/single_column.jpg)

In [23]:
# [] 이용
col = df['col5']
print(type(col))
col

<class 'pandas.core.series.Series'>

idx0     9
idx1    60
idx2     2
idx3    44
idx4    27
idx5    97
idx6    13
idx7    11
idx8    19
idx9    30
Name: col5, dtype: int32

In [24]:
# loc 이용(DataSeries 형태, 대괄호 유무)
col = df.loc[:,'col5']
print(type(col))
col

<class 'pandas.core.series.Series'>

idx0     9
idx1    60
idx2     2
idx3    44
idx4    27
idx5    97
idx6    13
idx7    11
idx8    19
idx9    30
Name: col5, dtype: int32

In [26]:
# loc 이용(DataFrame 형태, 대괄호 유무)
col = df.loc[:,['col5']]
print(type(col))
col

<class 'pandas.core.frame.DataFrame'>

      col5
idx0     9
idx1    60
idx2     2
idx3    44
idx4    27
idx5    97
idx6    13
idx7    11
idx8    19
idx9    30

In [27]:
# iloc 이용(DataSeries 형태, 대괄호 유무)
col = df.iloc[:,5]
print(type(col))
col

<class 'pandas.core.series.Series'>

idx0     9
idx1    60
idx2     2
idx3    44
idx4    27
idx5    97
idx6    13
idx7    11
idx8    19
idx9    30
Name: col5, dtype: int32

In [29]:
# iloc 이용(DataFrame 형태, 대괄호 유무)
col = df.iloc[:,[5]]
print(type(col))
col

<class 'pandas.core.frame.DataFrame'>

      col5
idx0     9
idx1    60
idx2     2
idx3    44
idx4    27
idx5    97
idx6    13
idx7    11
idx8    19
idx9    30

### 단일 열 선택하는 경우
- []를 이용하는 경우   
    df['column 이름']   

- loc 를 이용하는 경우   
    1. Series 형태   
        df.loc[:,'column이름']   
    2. DataFrame 형태   
        df.loc[:,['column이름']]   

- iloc 이용하는 경우   
    1. Series 형태   
        df.iloc[,column 번호]   
    2. DataFrame 형태   
        df.iloc[,[column 번호]]

### multi rows(continuous)

![picTitle](./DataFrame_pic/multi_row_1.jpg)

In [31]:
# []이용
multi_row = df['idx6':'idx7']
print(type(multi_row))
multi_row

<class 'pandas.core.frame.DataFrame'>

      col0  col1  col2  col3  col4  col5  col6  col7  col8  col9
idx6    94     8    56    68    35    13    72    76    95    15
idx7     9    63    68    15    61    11    39    94    52     9

In [32]:
# loc이용
multi_row = df.loc['idx6':'idx7']
print(type(multi_row))
multi_row

<class 'pandas.core.frame.DataFrame'>

      col0  col1  col2  col3  col4  col5  col6  col7  col8  col9
idx6    94     8    56    68    35    13    72    76    95    15
idx7     9    63    68    15    61    11    39    94    52     9

In [33]:
# iloc이용
multi_row = df.iloc[6:8]
print(type(multi_row))
multi_row

<class 'pandas.core.frame.DataFrame'>

      col0  col1  col2  col3  col4  col5  col6  col7  col8  col9
idx6    94     8    56    68    35    13    72    76    95    15
idx7     9    63    68    15    61    11    39    94    52     9

- [], loc의 경우   
    'idx_x':'idx_y' => 'idx_y' 포함
- iloc의 경우   
    'idx_num_x':'idx_num_y' => 'idx_num_y' 포함 X

### multi rows(non continuous)

![picTitle](multi_row_2.jpg)

In [38]:
# []이용
multi_row = pd.concat([df['idx1':'idx1'], df['idx5':'idx7']])
print(type(multi_row))
multi_row

<class 'pandas.core.frame.DataFrame'>

      col0  col1  col2  col3  col4  col5  col6  col7  col8  col9
idx1    39    59    62    26    27    60    30    15    45    36
idx5    62    40    37    24    76    97    74    83    10    97
idx6    94     8    56    68    35    13    72    76    95    15
idx7     9    63    68    15    61    11    39    94    52     9

##### concat()  
- pd.concat([df1, df2])  
- [] 가 있음에 주의

In [43]:
# loc이용
multi_row = df.loc[['idx1','idx5','idx6','idx7']]
print(type(multi_row))
multi_row

<class 'pandas.core.frame.DataFrame'>

      col0  col1  col2  col3  col4  col5  col6  col7  col8  col9
idx1    39    59    62    26    27    60    30    15    45    36
idx5    62    40    37    24    76    97    74    83    10    97
idx6    94     8    56    68    35    13    72    76    95    15
idx7     9    63    68    15    61    11    39    94    52     9

df.loc[['idx_name','idx_name', ...]]

In [45]:
# iloc이용
multi_row = df.iloc[[1,5,6,7]]
print(type(multi_row))
multi_row

<class 'pandas.core.frame.DataFrame'>

      col0  col1  col2  col3  col4  col5  col6  col7  col8  col9
idx1    39    59    62    26    27    60    30    15    45    36
idx5    62    40    37    24    76    97    74    83    10    97
idx6    94     8    56    68    35    13    72    76    95    15
idx7     9    63    68    15    61    11    39    94    52     9

df.iloc[['idx_num','idx_num', ...]]

### multi columns(continuous)

![picTitle](multi_column_1.jpg)

In [47]:
# []이용
multi_col = pd.concat([df['col1'],df['col2'],df['col3']], axis = 1)
print(type(multi_col))
multi_col

<class 'pandas.core.frame.DataFrame'>

      col1  col2  col3
idx0    56    30    77
idx1    59    62    26
idx2    74    94    43
idx3    26    64    13
idx4    28    32    92
idx5    40    37    24
idx6     8    56    68
idx7    63    68    15
idx8    58    21    34
idx9    25    11    34

In [48]:
# loc이용
multi_col = df.loc[:,'col1':'col3']
print(type(multi_col))
multi_col

<class 'pandas.core.frame.DataFrame'>

      col1  col2  col3
idx0    56    30    77
idx1    59    62    26
idx2    74    94    43
idx3    26    64    13
idx4    28    32    92
idx5    40    37    24
idx6     8    56    68
idx7    63    68    15
idx8    58    21    34
idx9    25    11    34

In [49]:
# iloc이용
multi_col = df.iloc[:,1:4]
print(type(multi_col))
multi_col

<class 'pandas.core.frame.DataFrame'>

      col1  col2  col3
idx0    56    30    77
idx1    59    62    26
idx2    74    94    43
idx3    26    64    13
idx4    28    32    92
idx5    40    37    24
idx6     8    56    68
idx7    63    68    15
idx8    58    21    34
idx9    25    11    34

### multi columns(non continuous)

![picTitle](multi_column_2.jpg)

In [50]:
# []이용
multi_col = pd.concat([df['col3'],df['col6'],df['col7']], axis = 1)
print(type(multi_col))
multi_col

<class 'pandas.core.frame.DataFrame'>

      col3  col6  col7
idx0    77    40    84
idx1    26    30    15
idx2    43    19    29
idx3    13    62    25
idx4    92     3    65
idx5    24    74    83
idx6    68    72    76
idx7    15    39    94
idx8    34     4     7
idx9    34    87    83

In [51]:
# loc이용
multi_col = df.loc[:,['col3','col6','col7']]
print(type(multi_col))
multi_col

<class 'pandas.core.frame.DataFrame'>

      col3  col6  col7
idx0    77    40    84
idx1    26    30    15
idx2    43    19    29
idx3    13    62    25
idx4    92     3    65
idx5    24    74    83
idx6    68    72    76
idx7    15    39    94
idx8    34     4     7
idx9    34    87    83

In [52]:
# iloc이용
multi_col = df.iloc[:,[3,6,7]]
print(type(multi_col))
multi_col

<class 'pandas.core.frame.DataFrame'>

      col3  col6  col7
idx0    77    40    84
idx1    26    30    15
idx2    43    19    29
idx3    13    62    25
idx4    92     3    65
idx5    24    74    83
idx6    68    72    76
idx7    15    39    94
idx8    34     4     7
idx9    34    87    83

### range

![picTitle](range_1.jpg)

In [64]:
# [] 이용
range = pd.concat([df['idx0':'idx2']['col0'],df['idx0':'idx2']['col1'],df['idx0':'idx2']['col2'],df['idx0':'idx2']['col3'],df['idx0':'idx2']['col4'],],axis=1)
print(type(range))
range

<class 'pandas.core.frame.DataFrame'>

      col0  col1  col2  col3  col4
idx0    56    56    30    77    26
idx1    39    59    62    26    27
idx2    63    74    94    43    87

In [65]:
# loc 이용
range = df.loc['idx0':'idx2','col0':'col4']
print(type(range))
range

<class 'pandas.core.frame.DataFrame'>

      col0  col1  col2  col3  col4
idx0    56    56    30    77    26
idx1    39    59    62    26    27
idx2    63    74    94    43    87

In [66]:
# iloc 이용
range = df.iloc[0:3,0:5]
print(type(range))
range

<class 'pandas.core.frame.DataFrame'>

      col0  col1  col2  col3  col4
idx0    56    56    30    77    26
idx1    39    59    62    26    27
idx2    63    74    94    43    87

### 정리

- loc, iloc 사용을 지향. []사용은 지양. 
   
- 타인의 코드에서 []가 나왔을 때는 접근하는 방식이 다름을 인지하고 헷갈리지 않도록 주의 필요.   

- df.loc['idx3':'idx5'] , df.iloc[3:6]
    - 포함여부(loc: 포함, iloc: 미포함)